[
  {
    "char": "イ",
    "code": "・－"
  },
  {
    "char": "ロ",
    "code": "・－・－"
  },
  {
    "char": "ハ",
    "code": "－・・・"
  },
  {
    "char": "ニ",
    "code": "－・－・"
  },
  {
    "char": "ホ",
    "code": "－・・"
  },
  {
    "char": "ヘ",
    "code": "・"
  },
  {
    "char": "ト",
    "code": "・・－・・"
  },
  {
    "char": "チ",
    "code": "・・－・"
  },
  {
    "char": "リ",
    "code": "－－・"
  },
  {
    "char": "ヌ",
    "code": "・・・・"
  },
  {
    "char": "ル",
    "code": "－・－－・"
  },
  {
    "char": "ヲ",
    "code": "・－－－"
  },
  {
    "char": "ワ",
    "code": "－・－"
  },
  {
    "char": "カ",
    "code": "・－・・"
  },
  {
    "char": "ヨ",
    "code": "－－"
  },
  {
    "char": "タ",
    "code": "－・"
  },
  {
    "char": "レ",
    "code": "－－－"
  },
  {
    "char": "ソ",
    "code": "－－－・"
  },
  {
    "char": "ツ",
    "code": "・－－・"
  },
  {
    "char": "ネ",
    "code": "－－・－"
  },
  {
    "char": "ナ",
    "code": "・－・"
  },
  {
    "char": "ラ",
    "code": "・・・"
  },
  {
    "char": "ム",
    "code": "－"
  },
  {
    "char": "ウ",
    "code": "・・－"
  },
  {
    "char": "ヰ",
    "code": "・－・・－"
  },
  {
    "char": "ノ",
    "code": "・・－－"
  },
  {
    "char": "オ",
    "code": "・－・・・"
  },
  {
    "char": "ク",
    "code": "・・・－"
  },
  {
    "char": "ヤ",
    "code": "・－－"
  },
  {
    "char": "マ",
    "code": "－・・－"
  },
  {
    "char": "ケ",
    "code": "－・－－"
  },
  {
    "char": "フ",
    "code": "－－・・"
  },
  {
    "char": "コ",
    "code": "－－－－"
  },
  {
    "char": "エ",
    "code": "－・－－－"
  },
  {
    "char": "テ",
    "code": "・－・－－"
  },
  {
    "char": "ア",
    "code": "－－・－－"
  },
  {
    "char": "サ",
    "code": "－・－・－"
  },
  {
    "char": "キ",
    "code": "－・－・・"
  },
  {
    "char": "ユ",
    "code": "－・・－－"
  },
  {
    "char": "メ",
    "code": "－・・・－"
  },
  {
    "char": "ミ",
    "code": "・・－・－"
  },
  {
    "char": "シ",
    "code": "・・－－・－・"
  },
  {
    "char": "ヱ",
    "code": "・－－・・"
  },
  {
    "char": "ヒ",
    "code": "－－・・－"
  },
  {
    "char": "モ",
    "code": "－・・－・"
  },
  {
    "char": "セ",
    "code": "・－－－・"
  },
  {
    "char": "ス",
    "code": "－－－・－"
  },
  {
    "char": "ン",
    "code": "・－・－・"
  },
  {
    "char": "゛",
    "code": "・・"
  },
  {
    "char": "゜",
    "code": "・・－－・"
  },
]
